balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F86J99.PIC
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0xFC" edc:offset="0x01"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0xDF" edc:offset="0x01"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="H"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="J"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="A"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="B"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="C"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="D"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="E"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="F"/>
          <edc:ModuleExclude edc:impl="0xFC" edc:offset="0x02"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="G"/>
          <edc:ModuleExclude edc:impl="0xDF" edc:offset="0x02"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="H"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-PORTx_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="J"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01381_clk_sib_v10_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x5" edc:end="0x6" edc:modsrc="DOS-01491_eccp_v3_8Bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x52" edc:end="0x5d" edc:modsrc="DOS-01378_PIC18F97J94.Module">
          <edc:ModuleExclude edc:impl="0xF7" edc:offset="0x5B"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01563_lvd_ctrl_v5_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x5d" edc:end="0x5e" edc:modsrc="DOS-01378_PIC18F97J94.Module">
          <edc:ModuleExclude edc:impl="0xF7" edc:offset="0x5D"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01474_tmr_Timer1_v5_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x6B" edc:end="0x70" edc:modsrc="DOS-01378_PIC18F97J94.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x4" edc:modsrc="DOS-01474_tmr_Timer1_v5_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x5e" edc:end="0x63" edc:modsrc="DOS-01378_PIC18F97J94.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x5" edc:modsrc="DOS-01491_eccp_v3_8Bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x2" edc:modsrc="DOS-01568_cmp_control_v2_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01568_cmp_control_v2_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x1A" edc:end="0x1C" edc:modsrc="DOS-01277_adc_1012_v4_8bit.Module">
          <edc:ModuleExclude edc:impl="0xF7" edc:offset="0x1A"/>
          <edc:ModuleExclude edc:impl="0x87" edc:offset="0x1B"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01277_adc_result_buf_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x2" edc:end="0x3" edc:modsrc="DOS-01568_cmp_control_v2_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x4" edc:end="0x7" edc:modsrc="DOS-01490_mssp_v6_8Bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01490_mssp_v6_8Bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x3" edc:modsrc="DOS-01504_tmr_Timer2_v3_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x1" edc:end="0x4" edc:modsrc="DOS-01474_tmr_Timer1_v5_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x3" edc:end="0x4" edc:modsrc="DOS-01447_rst_integration_v7_8bit.Module"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-01565_int_on_change_v3_8Bit.Module"/>
        <edc:Module_ref edc:begin="0x63" edc:end="0x64" edc:modsrc="DOS-01378_PIC18F97J94.Module"/>
        <edc:Module_ref edc:begin="0x5" edc:end="0x6" edc:modsrc="DOS-01381_clk_sib_v10_8Bit.Module"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x3" edc:modsrc="DOS-01614_tmr_timer0_v2_8bit.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="0"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x18" edc:modsrc="DOS-01558_cpu_pic18f_core_v4.Module"/>
        <edc:Module_ref edc:begin="0x64" edc:end="0x67" edc:modsrc="DOS-01378_PIC18F97J94.Module"/>
        <edc:Module_ref edc:begin="0x18" edc:end="0x25" edc:modsrc="DOS-01558_cpu_pic18f_core_v4.Module"/>
      </edc:SFRDataSector>
      <edc:NMMRPlace edc:regionid="peripheralnmmrs">
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR0_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR0_Internal" edc:nmmrid="0xA" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
